public class Main {
    public static void main(String[] args) {

        try {
            String s = null;
            s.equals("oops");
        } catch (NullPointerException e) {
            System.out.println("ERROR..."+e);
        }

    }
}

/*
--> Οι μεταβλητές-μέλη μιας κλάσης αρχικοποιούνται αυτόματα με default τιμές του μεταγλωττιστή. Π.χ. αν έχουμε μια μεταβλητή μέλος String name μέσα σε μια κλάση class Employee τότε ξέρουμε ότι αυτή θα έχει αρχικοποιηθεί με null
--> Οι τοπικές μεταβλητές σε μεθόδους ΔΕΝ αρχικοποιούνται. Μπαίνουν σε μια κατάσταση που δεν είναι initialized και ο μεταγλωττιστής αυτό το θεωρεί ως συντακτικό λάθος και χτυπάει κατά τη μεταγλώττιση.
Κάνε την επαλήθευση γράφοντας τον ίδιο κώδικα χωρίς το =null; και θα διαπιστώσεις ότι ο μεταγλωττιστής το κοκκινίζει (το IntelliJ υποδεικνύει συντακτικά λάθη, χωρίς καν να κάνεις τυπικά τη μεταγλώττιση)
* */